**출처 : 파이썬 머신러닝 판다스 데이터 분석, 오승환 지음, 정보문화사**

### [판다스의 자료구조]

- [**시리즈(Series)**](#시리즈(Series))
    - [시리즈 만들기](#시리즈-만들기)
    - [인덱스 구조](#인덱스-구조)
    - [인덱싱(indexing)](#인덱싱(indexing))


- [**데이터프레임(Dataframe)**](#데이터프레임(Dataframe))
    - [딕셔너리 이용하여 데이터프레임 만들기](#딕셔너리-이용하여-데이터프레임-만들기)
    - [행 인덱스/열 이름 설정하여 데이터프레임 생성](#행-인덱스/열-이름-설정하여-데이터프레임-생성)
    - [행/열 삭제](#행/열-삭제)
    - [행 선택](#행-선택)
    - [열 선택](#열-선택)
    - [요소 선택](#요소-선택)
    - [열 추가](#열-추가)
    - [행 추가](#행-추가)
    - [요소 값 변경](#요소-값-변경)
    - [행, 열의 위치 바꾸기](#행,-열의-위치-바꾸기)

-------

# 판다스의 자료구조

## 시리즈(Series)

* 시리즈는 데이터가 순차적으로 나열된 1차원 배열의 형태
* 인덱스(index)와 데이터 값(value)과 일대일 대응
* 키(key)와 값(value)이 "{키:값}" 형태의 쌍으로 이루어진 딕셔너리(dictionary)와 비슷한 구조

### 시리즈 만들기
* 딕셔너리와 시리즈의 구조가 비슷하기 때문에 딕셔너리를 시리즈로 쉽게 변환 가능
* 판다스 내장 함수인 Series()를 이용

In [1]:
# 딕셔너리 -> 시리즈 변환
import pandas as pd

dict_data = {'a':1, 'b':2, 'c':3}

sr = pd.Series(dict_data)

print(type(sr))
print()
print(sr)

<class 'pandas.core.series.Series'>

a    1
b    2
c    3
dtype: int64

### 인덱스 구조
* 인덱스는 짝을 이루는 데이터 값의 순서와 주소를 저장
* 인덱스 종류 : 정수형 위치 인덱스, 인덱스 이름(index name) 또는 인덱스 라벨(index label)
* 시리즈 클래스의 index 속성을 이용하여 인덱스 배열을 따로 선택 가능 : Series객체.index
* 데이터 값 배열만 따로 선택 : Series객체.values

In [2]:
print(sr.index)
print()
print(sr.values)

Index(['a', 'b', 'c'], dtype='object')

[1 2 3]

In [3]:
list_data = ['2020-06-01', 3.14, 'ABC', 100, True]
sr = pd.Series(list_data) # list를 이용해서 시리즈를 생성
print(sr)

0    2020-06-01
1          3.14
2           ABC
3           100
4          True
dtype: object

In [4]:
print(sr.index)
print(sr.values)

RangeIndex(start=0, stop=5, step=1)
['2020-06-01' 3.14 'ABC' 100 True]

### 인덱싱(indexing)
* 요소의 위치를 나타내는 인덱스를 이용하여 시리즈의 요소를 선택
* 하나의 요소 선택, 여러 요소를 한꺼번에 선택, 파이썬의 리스트 슬라이싱 기법과 비슷하게 인덱스 범위를 지정하여 요소를 선택
* 인덱스의 유형(정수형 위치 인덱스, 인덱스 이름)에 따라 사용법이 조금 다름.
* 인덱스 이름(라벨) : 대괄호 안에 이름과 함께 따옴표 입력, 쌍따옴표 홑따옴표 모두 사용 가능

In [9]:
import pandas as pd
tup_data = ('영인', '2010-05-01', '여', True)
sr = pd.Series(tup_data, index=['이름', '생년월일', '성별', '학생여부'])
print(sr)

이름              영인
생년월일    2010-05-01
성별               여
학생여부          True
dtype: object

In [10]:
print(sr[0])
print()
print(sr['이름'])

영인

영인

In [11]:
print(sr[2])
print()
print(sr['성별'])

여

여

In [15]:
# 인덱스를 리스트 형태로 지정
print(sr[[1,2]])
print()
print(sr[['생년월일', '성별']])
print(type(sr[[1,2]]))

생년월일    2010-05-01
성별               여
dtype: object

생년월일    2010-05-01
성별               여
dtype: object
<class 'pandas.core.series.Series'>

In [18]:
print(sr[1:2])
print()
print(sr['생년월일':'성별'])

생년월일    2010-05-01
dtype: object

생년월일    2010-05-01
성별               여
dtype: object

In [16]:
print(sr[1:3])
print()
print(sr['생년월일':'성별'])

생년월일    2010-05-01
성별               여
dtype: object

생년월일    2010-05-01
성별               여
dtype: object

In [17]:
print(sr[1:4])
print()
print(sr['생년월일':'학생여부'])

생년월일    2010-05-01
성별               여
학생여부          True
dtype: object

생년월일    2010-05-01
성별               여
학생여부          True
dtype: object

## 데이터프레임(Dataframe)

* 데이터프레임은 2차원 배열 구조이다.
* 데이터프레임의 열은 각각 시리즈 객체이다.

### 딕셔너리 이용하여 데이터프레임 만들기

* 데이터프레임을 만들 때는 판다스의 DataFrame() 함수를 사용
* 딕셔너리를 데이터프레임으로 변환 : pd.DataFrame(딕셔너리 객체)

In [20]:
import pandas as pd

dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

df = pd.DataFrame(dict_data)

print(type(df))
print()
print(df)

<class 'pandas.core.frame.DataFrame'>
   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [21]:
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

### 행 인덱스/열 이름 설정하여 데이터프레임 생성

* 행 인덱스/열 이름 설정 : pd.DataFrame(2차원 배열, index=행 인덱스 배열, columns=열 이름 배열)

In [23]:
import pandas as pd

# 행 인덱스/열 이름 지정하여, 데이터프레임 만들기
df = pd.DataFrame([[15, '남', '단국중'], [17, '여', '용인중']],
                  index=['준서', '예은'],
                  columns=['나이', '성별', '학교'])

# 행 인덱스, 열 이름 확인하기
print(df)            #데이터프레임
print()
print(df.index)      #행 인덱스
print()
print(df.columns)    #열 이름

    나이 성별   학교
준서  15  남  단국중
예은  17  여  용인중

Index(['준서', '예은'], dtype='object')

Index(['나이', '성별', '학교'], dtype='object')

* 행 인덱스 변경 : 데이터프레임객체.index = 새로운 행 인덱스 배열
* 열 이름 변경 : 데이터프레임객체.columns = 새로운 열 이름 배열

In [25]:
# 행 인덱스, 열 이름 변경하기
df.index=['학생1', '학생2']
df.columns=['연령', '남녀', '소속']

# 행 인덱스, 열 이름 확인하기
print(df)            #데이터프레임
print()
print(df.index)      #행 인덱스
print()
print(df.columns)    #열 이름

     연령 남녀   소속
학생1  15  남  단국중
학생2  17  여  용인중

Index(['학생1', '학생2'], dtype='object')

Index(['연령', '남녀', '소속'], dtype='object')

* 행 인덱스 변경 : 데이터프레임객체.rename(index = {기존 인덱스:새 인덱스, ... })
* 열 이름 변경 : 데이터프레임객체.rename(columns = {기존 이름:새 이름, ... })

In [26]:
import pandas as pd

# 행 인덱스/열 이름 지정하여, 데이터프레임 만들기
df = pd.DataFrame([[15, '남', '덕영중'], [17, '여', '수리중']],
                  index=['준서', '예은'],
                  columns=['나이', '성별', '학교'])

print(df)
print

# 열 이름 중, '나이'를 '연령'으로, '성별'을 '남녀'로, '학교'를 '소속'으로 바꾸기
df.rename(columns={'나이':'연령', '성별':'남녀', '학교':'소속'}, inplace=True)

# df의 행 인덱스 중에서, '준서'를 '학생1'로, '예은'을 '학생2'로 바꾸기
df.rename(index={'준서':'학생1', '예은':'학생2'}, inplace=True)

# df 출력(변경 후)
print(df)

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중
     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

### 행/열 삭제

* 행 삭제 : 데이터프레임객체.drop(행 인덱스 또는 배열, axis=0)
* 열 삭제 : 데이터프레임객체.drop(열 이름 또는 배열, axis=1)

In [27]:
# 행 삭제
import pandas as pd

# DataFrame() 함수로 데이터프레임 변환, 변수 df에 저장
exam_data = {'수학' : [90, 80, 70], '영어' : [98, 89, 95],
             '음악' : [85, 95, 100], '체육' : [100, 90, 90]}

df = pd.DataFrame(exam_data, index=['서운', '우현', '인아'])
print(df)
print()

# 데이터프레임 df를 복제하여 변수 df2에 저장, df2의 1개 행(row)을 삭제
df2 = pd.DataFrame(df)
#df2.drop('우현', inplace=True)
df2.drop('우현', inplace=True)
print(df2)
print('\n')

# 데이터프레임 df를 복제하여 변수 df3에 저장, df3의 2개 행(row)을 삭제
df3=pd.DataFrame(df)
df3.drop(['우현', '인아'], axis=0, inplace=True)
print(df3)

    수학  영어   음악   체육
서운  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

    수학  영어   음악   체육
서운  90  98   85  100
인아  70  95  100   90


    수학  영어  음악   체육
서운  90  98  85  100

In [32]:
# 행 삭제
import pandas as pd

# DataFrame() 함수로 데이터프레임 변환, 변수 df에 저장
exam_data = {'수학' : [90, 80, 70], '영어' : [98, 89, 95],
             '음악' : [85, 95, 100], '체육' : [100, 90, 90]}

df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [33]:
# 데이터프레임 df를 복제하여 변수 df2에 저장, df2의 1개 행(row)을 삭제
df2 = pd.DataFrame(df)
#df2.drop('우현', inplace=True)
df2.drop('우현', inplace=True)
df2

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [34]:
# 데이터프레임 df를 복제하여 변수 df3에 저장, df3의 2개 행(row)을 삭제
df3=pd.DataFrame(df)
df3.drop(['우현', '인아'], axis=0, inplace=True)
df3

    수학  영어  음악   체육
서준  90  98  85  100

In [35]:
# 열 삭제
import pandas as pd

exam_data = {'수학' : [90, 80, 70], '영어' : [98, 89, 95],
             '음악' : [85, 95, 100], '체육' : [100, 90, 90]}

df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])
print(df)
print()

# 데이터프레임 df를 복제하여 변수 df4에 저장, df4의 1개 열(column)을 삭제
df4 = pd.DataFrame(df)
df4.drop('수학', axis=1, inplace=True)
print(df4)
print()

# 데이터프레임 df를 복제하여 변수 df5에 저장, df5의 2개 열(column)을 삭제
df5=pd.DataFrame(df)
df5.drop(['영어', '음악'], axis=1, inplace=True)
print(df5)

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

    수학   체육
서준  90  100
우현  80   90
인아  70   90

In [36]:
# 열 삭제
import pandas as pd

exam_data = {'수학' : [90, 80, 70], '영어' : [98, 89, 95],
             '음악' : [85, 95, 100], '체육' : [100, 90, 90]}

df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [37]:
# 데이터프레임 df를 복제하여 변수 df4에 저장, df4의 1개 열(column)을 삭제
df4 = pd.DataFrame(df)
df4.drop('수학', axis=1, inplace=True)
df4

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [38]:
# 데이터프레임 df를 복제하여 변수 df5에 저장, df5의 2개 열(column)을 삭제
df5=pd.DataFrame(df)
df5.drop(['영어', '음악'], axis=1, inplace=True)
df5

    수학   체육
서준  90  100
우현  80   90
인아  70   90

### 행 선택

* 데이터프레임의 행 데이터를 선택하기 위해서 loc와 iloc 을 사용
* 인덱스 이름(index label)을 기준으로 행을 선택할 때 loc 을 사용하고, 정수형 위치 인덱스(integer position)를 사용할 때는 iloc 을 사용
* loc의 범위지정 : 가능(범위의 끝 포함), 예) ['a' : 'c'] -> 'a','b','c'
* iloc의 범위지정 : 가능(범위의 끝 제외), 예) [3:7] -> 3,4,5,6

In [40]:
import pandas as pd

# DataFrame() 함수로 데이터프레임 변환, 변수 df에 저장
exam_data = {'수학' : [90, 80, 70], '영어' : [98, 89, 95],
             '음악' : [85, 95, 100], '체육' : [100, 90, 90]}

df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [46]:
# 행 인덱스를 사용하여 행 1개를 선택
label1 = df.loc['서준']    # loc 인덱서 활용
position1 = df.iloc[0]     #iloc 인덱서 활용
print(label1)
print()
print(position1)
print(type(label1))

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64
<class 'pandas.core.series.Series'>

In [48]:
# 행 인덱스를 사용하여 2개 이상의 행 선택
label2 = df.loc[['서준', '우현']]
position2 = df.iloc[[0, 1]]
print(label2)
print()
print(position2)
print(type(label2))

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90
<class 'pandas.core.frame.DataFrame'>

In [49]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [47]:
# 행 인덱스의 범위를 지정하여 행 선택
label3 = df.loc['서준':'인아']
position3 = df.iloc[0:2]
print(label3)
print()
print(position3)

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

### 열 선택

* 열 1개 선택(시리즈 생성) : 데이터프레임객체['열 이름'] 또는 데이터프레임객체.열이름
* 열 n개 선택(데이터프레임 생성) : 데이터프레임객체[ ['열1 이름', '열1 이름', ... , '열n 이름'] ]

In [55]:
import pandas as pd

# DataFrame() 함수로 데이터프레임 변환, 변수 df에 저장
exam_data = {'이름' : ['서준', '우현', '인아'],
             '수학' : [90, 80, 70],
             '영어' : [98, 89, 95],
             '음악' : [85, 95, 100],
             '체육' : [100, 90, 90]}

df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [51]:
# '수학' 점수 데이터만 선택, 변수 math1에 저장
math1 = df['수학']
print(math1)
print(type(math1))

0    90
1    80
2    70
Name: 수학, dtype: int64
<class 'pandas.core.series.Series'>

In [61]:
# '영어' 점수 데이터만 선택, 변수 english에 저장
english = df.영어
print(english)
print(type(english))

0    98
1    89
2    95
Name: 영어, dtype: int64
<class 'pandas.core.series.Series'>

In [62]:
# '음악', '체육' 점수 데이터만 선택, 변수 music_gym 에 저장
music_gym = df[['음악', '체육']]
print(music_gym)
print(type(music_gym))

    음악   체육
0   85  100
1   95   90
2  100   90
<class 'pandas.core.frame.DataFrame'>

In [63]:
# '수학' 점수 데이터만 선택, 변수 math2에 저장
math2 = df[['수학']]
print(math2)
print(type(math2))

   수학
0  90
1  80
2  70
<class 'pandas.core.frame.DataFrame'>

### 요소 선택

* 데이터프레임의 행 인덱스와 열 이름을 [행, 열] 형식의 2차원 좌표로 입력하여 요소 위치를 지정
* 요소가 위치하는 행과 열의 좌표를 입력하면 해당 위치의 원소가 반환
* 1개의 행과 2개 이상의 열을 선택하거나 반대로 2개 이상의 행과 1개의 열을 선택하는 경우 시리즈 객체가 반환
* 2개 이상의 행과 2개 이상의 열을 선택하면, 데이터프레임 객체를 반환

* 인덱스 이름 사용하여 요소 선택 : 데이터프레임객체.loc[행 인덱스, 열 이름]
* 정수 위치 인덱스 사용하여 요소 선택 : 데이터프레임객체.iloc[행 번호, 열 번호]

In [65]:
import pandas as pd

# DataFrame() 함수로 데이터프레임 변환, 변수 df에 저장
exam_data = {'이름' : ['서준', '우현', '인아'],
             '수학' : [90, 80, 70],
             '영어' : [98, 89, 95],
             '음악' : [85, 95, 100],
             '체육' : [100, 90, 90]}

df = pd.DataFrame(exam_data)

# '이름' 열을 새로운 인덱스로 지정하고, df 객체에 변경사항 반영
df.set_index('이름', inplace=True)
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [66]:
# 데이터프레임 df의 특정 원소 1개 선택 ('서준'의 '음악' 점수)
a = df.loc['서준', '음악']
print(a)
print()
b = df.iloc[0, 2]
print(b)

85

85

In [67]:
# 데이터프레임 df의 특정 원소 2개 이상 선택 ('서준'의 '음악', '체육' 점수)
c = df.loc['서준', ['음악', '체육']]
print(type(c))
print(c)

<class 'pandas.core.series.Series'>
음악     85
체육    100
Name: 서준, dtype: int64

In [68]:
d = df.iloc[0, [2, 3]]
print(type(d))
print(d)

<class 'pandas.core.series.Series'>
음악     85
체육    100
Name: 서준, dtype: int64

In [69]:
e = df.loc['서준', '영어':'체육']
print(type(e))
print(e)

<class 'pandas.core.series.Series'>
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [72]:
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [70]:
f = df.iloc[0, 2:]
print(type(f))
print(f)

<class 'pandas.core.series.Series'>
음악     85
체육    100
Name: 서준, dtype: int64

In [71]:
# df의 2개 이상의 행과 열로부터 원소 선택 ('서준', '우현'의 '음악', '체육' 점수)
g = df.loc[['서준', '우현'], ['음악', '체육']]
print(type(g))
print(g)

<class 'pandas.core.frame.DataFrame'>
    음악   체육
이름
서준  85  100
우현  95   90

In [73]:
h = df.iloc[[0, 1], [2, 3]]
print(type(h))
print(h)

<class 'pandas.core.frame.DataFrame'>
    음악   체육
이름
서준  85  100
우현  95   90

In [74]:
i = df.loc['서준':'우현', '음악':'체육']
print(type(i))
print(i)

<class 'pandas.core.frame.DataFrame'>
    음악   체육
이름
서준  85  100
우현  95   90

In [75]:
j = df.iloc[0:2, 2:]
print(type(j))
print(j)

<class 'pandas.core.frame.DataFrame'>
    음악   체육
이름
서준  85  100
우현  95   90

### 열 추가

* 열 추가 : 데이터프레임객체['추가하려는 열 이름'] = 데이터값

In [76]:
import pandas as pd

# DataFrame() 함수로 데이터프레임 변환, 변수 df에 저장
exam_data = {'이름' : ['서준', '우현', '인아'],
             '수학' : [90, 80, 70],
             '영어' : [98, 89, 95],
             '음악' : [85, 95, 100],
             '체육' : [100, 90, 90]}

df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [77]:
# 데이터프레임 df에 '국어' 점수 열(column)을 추가, 데이터 값은 80 지정
df['국어'] = 80
df

   이름  수학  영어   음악   체육  국어
0  서준  90  98   85  100  80
1  우현  80  89   95   90  80
2  인아  70  95  100   90  80

### 행 추가

* 행추가 : 데이터프레임객체.loc['새로운 행 이름'] = 데이터 값(또는 배열)

In [78]:
import pandas as pd

# DataFrame() 함수로 데이터프레임 변환, 변수 df에 저장
exam_data = {'이름' : ['서준', '우현', '인아'],
             '수학' : [90, 80, 70],
             '영어' : [98, 89, 95],
             '음악' : [85, 95, 100],
             '체육' : [100, 90, 90]}

df = pd.DataFrame(exam_data)

# '이름' 열을 새로운 인덱스로 지정하고, df 객체에 변경사항 반영
df.set_index('이름', inplace=True)
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [79]:
# 새로운 행(row)을 추가 = 원소 값 여러 개의 배열 입력
df.loc['동규'] = [90, 80, 70, 60]
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90
동규  90  80   70   60

In [80]:
# 새로운 행(row)을 추가 - 기존 행을 복사
df.loc['수아'] = df.loc['동규']
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90
동규  90  80   70   60
수아  90  80   70   60

### 요소 값 변경

* 원소 값 변경 : 데이터프레임객체의 일부분 또는 원소를 선택 = 새로운 값

In [81]:
import pandas as pd

# DataFrame() 함수로 데이터프레임 변환, 변수 df에 저장
exam_data = {'이름' : ['서준', '우현', '인아'],
             '수학' : [90, 80, 70],
             '영어' : [98, 89, 95],
             '음악' : [85, 95, 100],
             '체육' : [100, 90, 90]}

df = pd.DataFrame(exam_data)

# '이름' 열을 새로운 인덱스로 지정하고, df 객체에 변경사항 반영
df.set_index('이름', inplace=True)
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [82]:
# 데이터프레임 df의 특정 원소를 변경하는 방법: '서준'의 '체육' 점수
df.iloc[0][3] = 80
df

    수학  영어   음악  체육
이름
서준  90  98   85  80
우현  80  89   95  90
인아  70  95  100  90

In [83]:
df.loc['서준']['체육'] = 90
df

    수학  영어   음악  체육
이름
서준  90  98   85  90
우현  80  89   95  90
인아  70  95  100  90

In [84]:
df.loc['서준', '체육'] = 100
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [85]:
# 데이터프레임 df의 원소 여러 개를 변경하는 방법: '서준'의 '음악', '체육' 점수
df.loc['서준', ['음악', '체육']] = 50
df

    수학  영어   음악  체육
이름
서준  90  98   50  50
우현  80  89   95  90
인아  70  95  100  90

In [86]:
df.loc['서준', ['음악', '체육']] = 100, 50
df

    수학  영어   음악  체육
이름
서준  90  98  100  50
우현  80  89   95  90
인아  70  95  100  90

### 행, 열의 위치 바꾸기

* 선형대수의 전치행렬과 같은 개념
* 행, 열 바꾸기 : 데이터프레임객체.transpose() 또는 데이터프레임객체.T

In [87]:
import pandas as pd

# DataFrame() 함수로 데이터프레임 변환, 변수 df에 저장
exam_data = {'이름' : ['서준', '우현', '인아'],
             '수학' : [90, 80, 70],
             '영어' : [98, 89, 95],
             '음악' : [85, 95, 100],
             '체육' : [100, 90, 90]}

df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [88]:
# 데이터프레임 df를 전치하기 (메소드 활용)
df = df.transpose()
df

      0   1    2
이름   서준  우현   인아
수학   90  80   70
영어   98  89   95
음악   85  95  100
체육  100  90   90

In [89]:
# 데이터프레임 df를 다시 전치하기 (클래스 속성 활용)
df = df.T
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90